const places = [
  {
    name: 'OH MY ZOO 寵物咖啡廳',
    lat: 25.0425012,
    lng: 121.5521667,
  },
  {
    name: '倉鼠甜點工作室',
    lat: 25.0392103,
    lng: 121.5253616,
  },
  {
    name: 'Tart club 蛋塔俱樂部(每月公休以ig發佈為主）',
    lat: 25.0554109,
    lng: 121.5188856,
  },
  {
    name: '富富',
    lat: 25.0462952,
    lng: 121.5102851,
  },
  {
    name: '灯火 AKARI 深夜咖啡（最後點餐為11點，無接待四人以上組別，營業時間請參考Ig公告）',
    lat: 24.9978364,
    lng: 121.5171202,
  },
  {
    name: '喫茶銀河 Kissa Ginga 咖啡',
    lat: 25.0419044,
    lng: 121.5109609,
  },
  {
    name: '裏 Ura.219',
    lat: 25.0597689,
    lng: 121.509508,
  },
];

export { places };
